# SideNum Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanCircuit..::..SideNum Property
PlanCircuit Class See Also
---
The number of sides in the circuit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int SideNum { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SideNum As Integer
	Get
```

Visual C++
---
```text
public:
property int SideNum {
	int get ();
}
```

# See Also
PlanCircuit Class
Autodesk.Revit.DB Namespace